[
  {
    "userId": "f981198f-032a-41cc-841d-e1b82c0828b2",
    "hackerName": "PracticalLeadMouse",
    "messageTitle": "Help with wireless HTTP on interface-calculate",
    "messageContent": "Sed velit reiciendis sit impedit natus sapiente sed. Nesciunt dignissimos at odio. Expedita voluptatibus dolores. Laudantium unde autem asperiores enim quas consequatur ut dolorem. Voluptate aliquam natus voluptate nisi dolorum ea.",
    "isResolved": false,
    "messageResponse": "We need to bypass the wireless XSS sensor!",
    "dateofResponse": "Tue Oct 10 2023 16:03:20 GMT-0400 (Eastern Daylight Time)",
    "numberOfUpvotes": 15
  },
  {
    "userId": "99fbf5cf-5d01-4c4a-ae8c-358795d3ba61",
    "hackerName": "LicensedAstatineCheese",
    "messageTitle": "Help with open-source PNG on system-generate",
    "messageContent": "Nesciunt facere libero hic ab natus incidunt. Quis incidunt libero cupiditate ratione reiciendis quibusdam exercitationem iste. Dolore vero quae modi in maxime iste voluptatem. Repellat consequuntur ducimus. Quaerat odio praesentium eaque nisi provident. Voluptatem error adipisci deserunt qui ex ex.",
    "isResolved": true,
    "messageResponse": "backing up the sensor won't do anything, we need to transmit the open-source RSS feed!",
    "dateofResponse": "Tue Oct 10 2023 10:10:50 GMT-0400 (Eastern Daylight Time)",
    "numberOfUpvotes": 2
  },
  {
    "userId": "a5c0dd55-710c-46ab-a148-4c546df42ee6",
    "hackerName": "IncredibleHeliumComputer",
    "messageTitle": "Help with virtual DRAM on firewall-calculate",
    "messageContent": "Veritatis necessitatibus expedita officia perferendis corrupti unde a ut. Quis eius consequuntur. Error minus vitae possimus dolorem debitis unde suscipit. In eveniet debitis aut nihil illum nobis occaecati at. Similique nihil maxime iusto. Totam nam adipisci similique non.",
    "isResolved": false,
    "messageResponse": "Try to synthesize the AI panel, maybe it will bypass the online feed!",
    "dateofResponse": "Mon Oct 09 2023 19:03:52 GMT-0400 (Eastern Daylight Time)",
    "numberOfUpvotes": 4
  },
  {
    "userId": "7e9dc89f-75e8-449e-9759-b28b68a8c2ad",
    "hackerName": "GorgeousHafniumPants",
    "messageTitle": "Help with digital RSS on alarm-transmit",
    "messageContent": "Nostrum a sint laborum quos iusto dolore vitae. Autem harum necessitatibus soluta dolore quos porro. Ipsum itaque vel. Temporibus nihil facere. Qui eaque dignissimos error quis animi veritatis. Error ea mollitia libero beatae suscipit molestiae pariatur omnis vel.",
    "isResolved": false,
    "messageResponse": "If we quantify the bandwidth, we can get to the HTTP driver through the optical FTP feed!",
    "dateofResponse": "Tue Oct 10 2023 10:05:50 GMT-0400 (Eastern Daylight Time)",
    "numberOfUpvotes": 4
  },
  {
    "userId": "aefae5ee-c002-4643-9b8a-fd562ed8d1e4",
    "hackerName": "LuxuriousNobeliumPants",
    "messageTitle": "Help with haptic XSS on monitor-navigate",
    "messageContent": "Hic incidunt in debitis consequatur consectetur modi ratione soluta. Et tempora maiores nihil minima iste amet repudiandae. Mollitia ea iusto accusamus dolor eligendi vel officia. Reiciendis natus unde vitae quibusdam suscipit excepturi explicabo magni.",
    "isResolved": false,
    "messageResponse": "The CSS driver is down, calculate the virtual driver so we can compress the PCI alarm!",
    "dateofResponse": "Tue Oct 10 2023 07:04:03 GMT-0400 (Eastern Daylight Time)",
    "numberOfUpvotes": 25
  },
  {
    "userId": "dfb3cb94-9fcc-4d07-9dfe-fb0a9168a613",
    "hackerName": "ElegantVanadiumChair",
    "messageTitle": "Help with 1080p SDD on bus-quantify",
    "messageContent": "Ut distinctio perspiciatis ducimus nesciunt dicta. Consequatur reiciendis suscipit ad. Quas molestiae nisi officiis minus temporibus voluptatum consequuntur. Nesciunt nihil omnis dolorum fugit iste optio autem voluptates eos. Tempore sunt perspiciatis.",
    "isResolved": true,
    "messageResponse": "We need to input the wireless PCI hard drive!",
    "dateofResponse": "Mon Oct 09 2023 20:19:59 GMT-0400 (Eastern Daylight Time)",
    "numberOfUpvotes": 8
  },
  {
    "userId": "ab05b687-5567-43f2-8cbd-2a742572c8c3",
    "hackerName": "OrientalTechnetiumBall",
    "messageTitle": "Help with cross-platform GB on driver-compress",
    "messageContent": "Deserunt id totam minus minima hic. Odio impedit dolorum sapiente voluptatibus quaerat inventore omnis corporis. Nostrum fugiat fugit corrupti doloremque voluptas eum cum illum. Ipsum eos quidem nobis fuga corporis. Molestias perferendis suscipit nulla.",
    "isResolved": false,
    "messageResponse": "If we bypass the hard drive, we can get to the JSON hard drive through the cross-platform SDD firewall!",
    "dateofResponse": "Tue Oct 10 2023 09:23:34 GMT-0400 (Eastern Daylight Time)",
    "numberOfUpvotes": 14
  },
  {
    "userId": "d973e033-9ff0-4de9-9ab9-2ec374ead324",
    "hackerName": "ModernMagnesiumMouse",
    "messageTitle": "Help with 1080p CLI on protocol-hack",
    "messageContent": "Nam fugiat alias quam nesciunt minima excepturi rem eum officia. Exercitationem consectetur dicta. Ducimus eos consequatur delectus nesciunt reiciendis earum amet ipsa. Quam modi et nemo quibusdam quaerat repellendus ipsam molestiae. Quas corrupti placeat minima exercitationem.",
    "isResolved": false,
    "messageResponse": "Use the redundant CSS feed, then you can synthesize the bluetooth protocol!",
    "dateofResponse": "Tue Oct 10 2023 12:02:58 GMT-0400 (Eastern Daylight Time)",
    "numberOfUpvotes": 10
  }
]