[
  {
    "id": "b54bc112-aba0-44e4-9d78-950530a3e0d0",
    "hackerName": "Normal Nobelium Horse",
    "messageTitle": "Help with wireless RSS on card-input",
    "messageContent": "Cum dolor doloribus minima quis. Pariatur quia molestias laborum porro quo nam dicta. Unde ut culpa. Voluptates dicta maiores ipsum quod libero similique aliquid aliquam consequuntur.",
    "isResolved": true,
    "messageResponse": "The GB protocol is down, parse the auxiliary protocol so we can generate the SMTP array!",
    "date": "2023-09-09T21:14:47.023Z",
    "numberOfUpvotes": 14458
  },
  {
    "id": "bee02e02-af57-47e6-b44b-d0cfe455aa32",
    "hackerName": "Elaborate Calcium Lion",
    "messageTitle": "Help with digital THX on program-bypass",
    "messageContent": "Dolores aliquid occaecati dolores delectus atque autem nulla. Eius delectus earum consequatur harum nihil maxime perspiciatis modi. Consectetur labore quod modi vel ad. Beatae inventore perspiciatis deleniti earum ratione. Officia earum aperiam corrupti.",
    "isResolved": true,
    "messageResponse": "If we program the array, we can get to the FTP transmitter through the auxiliary HDD driver!",
    "date": "2023-02-14T18:38:47.849Z",
    "numberOfUpvotes": 46862
  },
  {
    "id": "74496d62-7f10-4913-8839-4be4c85f9da1",
    "hackerName": "Bouncy Lead Cow",
    "messageTitle": "Help with haptic EXE on monitor-override",
    "messageContent": "Illum ut nostrum beatae. Iusto blanditiis cumque doloremque fuga quasi dicta quaerat iste. Corporis error eius quisquam vel dolores illum id placeat nihil. Maiores quidem labore culpa hic laudantium quis nulla. Rerum perferendis ipsum maiores numquam placeat a sunt. Distinctio veritatis corrupti hic doloremque inventore dolores possimus architecto.",
    "isResolved": true,
    "messageResponse": "connecting the application won't do anything, we need to quantify the primary API program!",
    "date": "2023-09-30T21:32:38.577Z",
    "numberOfUpvotes": 93785
  },
  {
    "id": "5c8d0d68-38bd-4fd1-8bf8-b25c6c90d9b3",
    "hackerName": "Unlucky Zirconium Horse",
    "messageTitle": "Help with redundant PNG on system-program",
    "messageContent": "Saepe laboriosam magni. Sint est exercitationem a occaecati. Placeat recusandae doloribus dignissimos saepe sequi molestias. Facilis neque occaecati. Accusamus iusto placeat incidunt vel.",
    "isResolved": true,
    "messageResponse": "We need to calculate the haptic ASCII protocol!",
    "date": "2023-01-06T21:25:28.812Z",
    "numberOfUpvotes": 72267
  },
  {
    "id": "cbf5b5f7-f6bb-4f0d-b09a-ce8a74c01d9c",
    "hackerName": "Incomplete Indium Cat",
    "messageTitle": "Help with bluetooth SQL on firewall-index",
    "messageContent": "Maxime distinctio quos rerum recusandae laudantium. Aspernatur eveniet accusamus velit odio fugiat facilis. Eaque id exercitationem debitis illum itaque veniam officiis cum laudantium.",
    "isResolved": true,
    "messageResponse": "Use the primary SSL card, then you can compress the open-source application!",
    "date": "2023-03-26T18:28:58.291Z",
    "numberOfUpvotes": 22218
  },
  {
    "id": "70b3f0e1-5bb2-4cf1-aae0-5dd8f9d0b022",
    "hackerName": "Smug Radium Rabbit",
    "messageTitle": "Help with bluetooth PNG on transmitter-reboot",
    "messageContent": "Fugit cumque blanditiis ab. Labore deleniti nobis dolorum rem officia assumenda. Architecto nemo magni. Aspernatur quidem id nam distinctio voluptate earum. Assumenda excepturi dolorum consectetur laudantium quae libero.",
    "isResolved": false,
    "messageResponse": "You can't copy the capacitor without connecting the bluetooth UTF8 bus!",
    "date": "2022-12-16T09:10:17.337Z",
    "numberOfUpvotes": 99899
  },
  {
    "id": "5e14d88c-17ca-45d4-b375-ea571f0018c5",
    "hackerName": "Brief Chromium Cow",
    "messageTitle": "Help with solid state PNG on alarm-input",
    "messageContent": "Nam eum molestiae necessitatibus sit debitis. Error animi aperiam. Explicabo odit laborum a. Neque magni adipisci eligendi ipsa dolor. Alias magni quae nostrum nam placeat dolore sequi autem aspernatur. Quasi saepe recusandae similique velit consequuntur.",
    "isResolved": false,
    "messageResponse": "The SQL protocol is down, reboot the cross-platform matrix so we can calculate the IP array!",
    "date": "2023-08-14T18:52:38.089Z",
    "numberOfUpvotes": 50242
  }
]